app/controllers/text_message_controller.rb

INSERT INTO `text_message_templates` (`text_message_body`, `updated_at`, `sent_at`, `template_name`, `text_message_subject`, `created_at`) VALUES('Hope your birthday blossoms into lots of dreams come true. Happy Birthday.....!!!!', '2012-12-14 10:59:29', '2012-12-14 10:59:29', NULL, 'Best Wishes!', '2012-12-14 10:59:29')
---
def save
  t = TextMessageTemplate.find(:first)
  if t.nil?
    @message = TextMessageTemplate.new
    @message.text_message_subject = params[:text_message_template][:subject]
    @message.text_message_body = params[:text_message_template][:body]
    @message.sent_at = Time.now
    @message.save

SELECT * FROM `users` WHERE (MONTH(birthdate)=12 AND DAY(birthdate) = 14)
SELECT * FROM `users`
SELECT * FROM `text_message_templates` LIMIT 1
---
  def send_email
  	 @user = User.find(:all, :conditions => ["Date(birthdate) = ?", Time.now.to_date ])
    t = TextMessageTemplate.find(:first)

    htmltext = ""

    #filter = params[:name]
    #if (filter.nil?)
    #  for f in filter
    #    puts "filter #{f} "

      @user.each do |usr|
       # if usr.id == f.to_i
         # puts "filter #{f}"
          body = "Happy Birthday #{usr.first_name}!!! #{t.text_message_body}"