app/controllers/users_controller.rb

def edit
  @user = User.find_by_id(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = '3') LIMIT 1

def create
    @user = User.new(params[:user])
    @user.salt = @user.generate_salt
    @user.password = @user.encrypt_password(params[:user][:password])
    @user.password_confirmation = @user.encrypt_password(params[:user][:password_confirmation])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`email`, `phone_number`, `user_type`, `birthdate`, `password`, `salt`, `first_name`, `updated_at`, `last_name`, `created_at`, `user_name`) VALUES('kumarsunilsangwan@gmail.com', 9019622676, 'guest', '1989-01-12', '5d9abf7df5b970f2c6c7661382c8c53d975f73b62d2bc6f16c66ce5ae3e7c4a0', 'zUsggivPrTE=', 'anilkumar', '2012-12-12 09:33:18', 'kumar', '2012-12-12 09:33:18', 'anilkumar')